init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-03 Mon 18:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrew Sanchez" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b31343">1. Init</a>
<ul>
<li><a href="#orge12e574">1.1. Sources</a></li>
<li><a href="#orgacc8625">1.2. Use-package</a></li>
<li><a href="#orgdc6994e">1.3. El-get</a></li>
<li><a href="#org558aad2">1.4. Global</a></li>
</ul>
</li>
<li><a href="#org10aced8">2. Personal info</a></li>
<li><a href="#org095cf22">3. Buffers</a></li>
<li><a href="#org2821332">4. Evil</a>
<ul>
<li><a href="#orgacc2a4b">4.1. Exclude list</a></li>
</ul>
</li>
<li><a href="#orgd0fd273">5. Helm</a></li>
<li><a href="#orgcbe9077">6. Hydra</a>
<ul>
<li><a href="#orgb0a5310">6.1. zoom</a></li>
</ul>
</li>
<li><a href="#org4680562">7. Org-mode</a>
<ul>
<li><a href="#orgc3f9302">7.1. Hydras</a>
<ul>
<li><a href="#org12ec1cb">7.1.1. Clock</a></li>
<li><a href="#org7f18d7a">7.1.2. Headings and trees</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbed1800">8. Windows and frames</a>
<ul>
<li><a href="#org0482b68">8.1. Save space by not showing the toolbar</a></li>
<li><a href="#org4b01978">8.2. Full screen</a></li>
<li><a href="#orgcfbaa96">8.3. Golden ratio mode</a></li>
<li><a href="#orgbc2eef2">8.4. winner mode</a></li>
</ul>
</li>
<li><a href="#org3098eac">9. Backups</a></li>
<li><a href="#org7ec1091">10. Magit</a></li>
<li><a href="#org72d2bfb">11. Better defaults</a></li>
<li><a href="#orge31d9f8">12. Tramp</a></li>
<li><a href="#org683e57f">13. Which-key</a></li>
<li><a href="#orgac6cd66">14. Python</a></li>
<li><a href="#org63831a3">15. Exec-path-from-shell</a></li>
<li><a href="#orga66943a">16. Smartparens</a></li>
<li><a href="#org12f3002">17. Projectile</a></li>
<li><a href="#org50d1acb">18. Yasnippet</a></li>
<li><a href="#orgcf00924">19. Themes and fonts</a></li>
<li><a href="#org19ccc3d">20. Completion</a></li>
<li><a href="#org0e8b1cb">21. Future</a>
<ul>
<li><a href="#org14ecf68">21.1. <span class="todo TODO">TODO</span> Create list for globally enabled packages</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9b31343" class="outline-2">
<h2 id="org9b31343"><span class="section-number-2">1</span> Init</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge12e574" class="outline-3">
<h3 id="orge12e574"><span class="section-number-3">1.1</span> Sources</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre><code class="src src-elisp">(package-initialize)
(add-to-list 'load-path "/Users/andrew/projects/emacs/packages/org-mode/lisp")
(setq package-archives
    '(("gnu" . "http://elpa.gnu.org/packages/")
      ("marmalade" . "http://marmalade-repo.org/packages/")
      ("melpa" . "http://melpa.milkbox.net/packages/")
      ("melpa-stable" . "http://stable.melpa.org/packages/")))

</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgacc8625" class="outline-3">
<h3 id="orgacc8625"><span class="section-number-3">1.2</span> Use-package</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre><code class="src src-elisp">(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile
  (require 'use-package))
(setq use-package-always-ensure t)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgdc6994e" class="outline-3">
<h3 id="orgdc6994e"><span class="section-number-3">1.3</span> El-get</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre><code class="src src-elisp">(add-to-list 'load-path "~/.emacs.d/el-get/el-get")

(unless (require 'el-get nil 'noerror)
  (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.githubusercontent.com/dimitri/el-get/master/el-get-install.el")
    (goto-char (point-max))
    (eval-print-last-sexp)))

(add-to-list 'el-get-recipe-path "~/.emacs.d/el-get-user/recipes")
(setq el-get-user-package-directory "~/.emacs.d/el-get-init-files")
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org558aad2" class="outline-3">
<h3 id="org558aad2"><span class="section-number-3">1.4</span> Global</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre><code class="src src-elisp">(add-hook 'after-init-hook
	  'global-company-mode)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org10aced8" class="outline-2">
<h2 id="org10aced8"><span class="section-number-2">2</span> Personal info</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre><code class="src src-elisp">(setq user-full-name "Andrew Sanchez"
      user-mail-address "inbox.asanchez@gmail.com")
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org095cf22" class="outline-2">
<h2 id="org095cf22"><span class="section-number-2">3</span> Buffers</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre><code class="src src-elisp">(evil-leader/set-key
  "bd" 'kill-this-buffer)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org2821332" class="outline-2">
<h2 id="org2821332"><span class="section-number-2">4</span> Evil</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package evil-leader
  :config
  (global-evil-leader-mode)
  (evil-leader/set-leader "&lt;SPC&gt;"))

  (use-package evil
    :config
    (evil-mode 1))

  (use-package evil-nerd-commenter
      :config
      (evilnc-default-hotkeys))

  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))

</code></pre>
</div>
</div>

<div id="outline-container-orgacc2a4b" class="outline-3">
<h3 id="orgacc2a4b"><span class="section-number-3">4.1</span> Exclude list</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre><code class="src src-elisp">(add-to-list 'evil-emacs-state-modes 'dired-mode)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd0fd273" class="outline-2">
<h2 id="orgd0fd273"><span class="section-number-2">5</span> Helm</h2>
<div class="outline-text-2" id="text-5">
<p>
Also check out <a href="https://github.com/abo-abo/swiper">ivy and swiper</a>
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package helm
    :init
    (require 'helm-config)
    (evil-leader/set-key
      "ff" 'helm-find-files
      "fm" 'helm-multi-files
      "fb" 'helm-filtered-bookmarks
      "bb" 'helm-buffers-list
      "sg" 'helm-google-suggest
      "&lt;SPC&gt;" 'helm-M-x
      "sj" 'helm-semantic-or-imenu
      "ha" 'helm-apropos
      "ss" 'helm-occur)
    :bind (("M-y" . helm-show-kill-ring)
	   ("C-h a" . helm-apropos)
	   ("M-x" . helm-M-x)
	   ("C-x b" . helm-buffers-list)))

(use-package helm-descbinds
  :bind (("C-h b" . helm-descbinds)))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgcbe9077" class="outline-2">
<h2 id="orgcbe9077"><span class="section-number-2">6</span> Hydra</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package hydra)
</code></pre>
</div>
</div>
<div id="outline-container-orgb0a5310" class="outline-3">
<h3 id="orgb0a5310"><span class="section-number-3">6.1</span> zoom</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre><code class="src src-elisp">(defhydra hydra-zoom (global-map "C-=")
  "zoom"
  ("g" text-scale-increase "in")
  ("l" text-scale-decrease "out"))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4680562" class="outline-2">
<h2 id="org4680562"><span class="section-number-2">7</span> Org-mode</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package org
  :load-path "/Users/andrew/projects/emacs/packages/org-mode/lisp"
  :config
  (setq org-hide-leading-stars t)
  (setq org-default-notes-file "/Users/andrew/org/notes.org")
  (setq org-capture-templates
      '(("t" "TODO" entry (file+headline "/Users/andrew/org/gtd.org" "Tasks")
	  "* TODO %? \nAdded:  %U\n" :empty-lines 1)
	  ("j" "Journal" entry (file+datetree "/Users/andrew/org/journal.org")
	  "* %?\nEntered on %U\n")
	  ("n" "Note" entry (file+headline "/Users/andrew/org/notes.org" "Notes")
	  "* %i\n")))
  (setq org-refile-targets '((org-agenda-files :maxlevel . 4)))
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path 'file)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-src-fontify-natively t)
  (setq org-agenda-files '("/Users/andrew/org/gtd.org"))
  ;; Hydras
  (evil-leader/set-key-for-mode 'org-mode
    "h" 'hydra-org-headings/body))

 (evil-leader/set-key
     "oa" 'org-agenda
     "oc" 'org-capture
     "ot" 'hydra-org-clock/body)

</code></pre>
</div>
</div>

<div id="outline-container-orgc3f9302" class="outline-3">
<h3 id="orgc3f9302"><span class="section-number-3">7.1</span> Hydras</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org12ec1cb" class="outline-4">
<h4 id="org12ec1cb"><span class="section-number-4">7.1.1</span> Clock</h4>
<div class="outline-text-4" id="text-7-1-1">
<div class="org-src-container">
<pre><code class="src src-elisp">
(defhydra hydra-org-clock (:color blue :hint nil)
    "

    Clock   In/out^     ^Edit^   ^Summary     (_?_)
    -----------------------------------------
	    _i_n         _e_dit   _g_oto entry
	    _c_ontinue   _q_uit   _d_isplay
	    _o_ut        ^ ^      _r_eport
    "
    ("i" org-clock-in)
    ("o" org-clock-out)
    ("c" org-clock-in-last)
    ("e" org-clock-modify-effort-estimate)
    ("q" org-clock-cancel)
    ("g" org-clock-goto)
    ("d" org-clock-display)
    ("r" org-clock-report)
    ("?" (org-info "Clocking commands")))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7f18d7a" class="outline-4">
<h4 id="org7f18d7a"><span class="section-number-4">7.1.2</span> Headings and trees</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<pre><code class="src src-elisp">
(defhydra hydra-org-headings ()
"Headings"
    ("t" org-todo "org-todo")
    (":" org-set-tags-command "org-set-tags-command")
    ("n" org-narrow-to-subtree "org-narrow-to-subtree")
    ("w" widen "widen")
    ("l" org-demote-subtree "org-demote-subtree")
    ("h" org-promote-subtree "org-promote-subtree")
    ("K" org-backward-heading-same-level "org-backward-heading-same-level")
    ("J" org-forward-heading-same-level "org-forward-heading-same-level")
    ("k" outline-previous-visible-heading "outline-previous-visible-heading")
    ("j" outline-next-visible-heading "outline-next-visible-heading"))
</code></pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbed1800" class="outline-2">
<h2 id="orgbed1800"><span class="section-number-2">8</span> Windows and frames</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org0482b68" class="outline-3">
<h3 id="org0482b68"><span class="section-number-3">8.1</span> Save space by not showing the toolbar</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre><code class="src src-elisp">(tool-bar-mode -1)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org4b01978" class="outline-3">
<h3 id="org4b01978"><span class="section-number-3">8.2</span> Full screen</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre><code class="src src-elisp">(custom-set-variables
 '(initial-frame-alist (quote ((fullscreen . maximized)))))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgcfbaa96" class="outline-3">
<h3 id="orgcfbaa96"><span class="section-number-3">8.3</span> Golden ratio mode</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package golden-ratio
  :config
  (golden-ratio-mode 1)
  (add-to-list 'golden-ratio-extra-commands
	       'evil-window-next
	       'evil-window-right
	       'evil-window-left
	       'evil-window-down
	       'evil-window-up))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgbc2eef2" class="outline-3">
<h3 id="orgbc2eef2"><span class="section-number-3">8.4</span> winner mode</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Undo and redo window configuration
Use <code>C-c &lt;left&gt;</code> and <code>C-c &lt;right&gt;</code> to switch between window configurations.
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package winner)
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3098eac" class="outline-2">
<h2 id="org3098eac"><span class="section-number-2">9</span> Backups</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre><code class="src src-elisp">(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org7ec1091" class="outline-2">
<h2 id="org7ec1091"><span class="section-number-2">10</span> Magit</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre><code class="src src-elisp">  (use-package magit
    :config
    (evil-leader/set-key
      "gs" 'magit-status))

;; Not sure why these aren't working
;; :config (setq magit-git-executable '("~/usr/bin/git"))
;; '(magit-git-executable "~/usr/bin/git")
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org72d2bfb" class="outline-2">
<h2 id="org72d2bfb"><span class="section-number-2">11</span> Better defaults</h2>
<div class="outline-text-2" id="text-11">
<p>
Also look at sensible-defaults
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(show-paren-mode 1)
(menu-bar-mode -1)
(when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
(when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)

(require 'saveplace)
(setq-default save-place t)
(fset 'yes-or-no-p 'y-or-n-p)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orge31d9f8" class="outline-2">
<h2 id="orge31d9f8"><span class="section-number-2">12</span> Tramp</h2>
<div class="outline-text-2" id="text-12">
<p>
This doesn't actually seem to be faster&#x2026;
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(setq tramp-default-method "ssh")
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org683e57f" class="outline-2">
<h2 id="org683e57f"><span class="section-number-2">13</span> Which-key</h2>
<div class="outline-text-2" id="text-13">
<p>
Also check out <a href="https://github.com/nonsequitur/smex">smex</a> 
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package which-key
    :config
    (which-key-mode))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgac6cd66" class="outline-2">
<h2 id="orgac6cd66"><span class="section-number-2">14</span> Python</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package python
  :config
  (setq python-shell-exec-path '("~/anaconda3/bin/python")))

(use-package anaconda-mode)
(add-hook 'python-mode-hook
	  'anaconda-mode
	  'anaconda-eldoc-mode)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org63831a3" class="outline-2">
<h2 id="org63831a3"><span class="section-number-2">15</span> Exec-path-from-shell</h2>
<div class="outline-text-2" id="text-15">
<p>
Doesn't seem to work for me :(
</p>
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package exec-path-from-shell)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orga66943a" class="outline-2">
<h2 id="orga66943a"><span class="section-number-2">16</span> Smartparens</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package smartparens
    :init
    (require 'smartparens-config)
    :config
    (autoload 'smartparens-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
    (add-hook 'emacs-lisp-mode-hook       #'smartparens-mode)
    (add-hook 'eval-expression-minibuffer-setup-hook #'smartparens-mode)
    (add-hook 'ielm-mode-hook             #'smartparens-mode)
    (add-hook 'lisp-mode-hook             #'smartparens-mode)
    (add-hook 'lisp-interaction-mode-hook #'smartparens-mode)
    (add-hook 'scheme-mode-hook           #'smartparens-mode))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org12f3002" class="outline-2">
<h2 id="org12f3002"><span class="section-number-2">17</span> Projectile</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre><code class="src src-elisp">
(use-package projectile
  :init
  (projectile-mode)
  :config
  (evil-leader/set-key
  "p" 'projectile-command-map))

(use-package helm-projectile
  :config
  (require 'helm-projectile)
  (helm-projectile-on))

</code></pre>
</div>
</div>
</div>

<div id="outline-container-org50d1acb" class="outline-2">
<h2 id="org50d1acb"><span class="section-number-2">18</span> Yasnippet</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package yasnippet :load-path "/Users/andrew/projects/emacs/packages/yasnippet"
  :config
  (require 'yasnippet)
  (yas-global-mode 1))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgcf00924" class="outline-2">
<h2 id="orgcf00924"><span class="section-number-2">19</span> Themes and fonts</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package solarized-theme)
(load-theme 'solarized-dark t)
(set-face-attribute 'default t :font 
  "-*-Source Code Pro-normal-normal-normal-*-*-*-*-*-m-0-iso10646-1")
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org19ccc3d" class="outline-2">
<h2 id="org19ccc3d"><span class="section-number-2">20</span> Completion</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">
<pre><code class="src src-elisp">(use-package company)
(eval-after-load "company"
  '(add-to-list 'company-backends 'company-anaconda))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org0e8b1cb" class="outline-2">
<h2 id="org0e8b1cb"><span class="section-number-2">21</span> Future</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org14ecf68" class="outline-3">
<h3 id="org14ecf68"><span class="section-number-3">21.1</span> <span class="todo TODO">TODO</span> Create list for globally enabled packages</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Sanchez</p>
<p class="date">Created: 2017-07-03 Mon 18:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
